app/controllers/acum_trabs_controller.rb

  def index
    if (params[:search].nil? || params[:search].empty?)
      if current_user.regiao_id == 53 or current_user.regiao_id == 52 then
        if params[:professor].present?
          @listagem = AcumTrab.paginate(:all, :include => 'professor',:page=>params[:page],:per_page =>20,:conditions => ['acum_trabs.status = 0 and professor_id = ?', params[:professor]])
---
SELECT * FROM `professors` ORDER BY matricula
SELECT * FROM `acum_trabs` WHERE (acum_trabs.status = 0 and professor_id = '876') LIMIT 0, 20
SELECT count(*) AS count_all FROM `acum_trabs` WHERE (acum_trabs.status = 0)

  def edit
    @acum_trab = AcumTrab.find(params[:id])
    @trabalho = Trabalhado.find(:all, :conditions => ['professor_id = ? and ano_letivo = ?', @acum_trab.professor_id, $data], :order => 'ano')
---
SELECT * FROM `acum_trabs` WHERE (`acum_trabs`.`id` = 1206)
SELECT * FROM `professors` WHERE (`professors`.`id` = 876)
SELECT * FROM `trabalhados` WHERE (professor_id = 876 and ano_letivo = '2012') ORDER BY ano

  def create
    @acum_trab = AcumTrab.new(params[:acum_trab])
    @log = Log.new
    @log.log(current_user.id, @acum_trab.professor_id, "Criado valores acumulados para o professor:#{@acum_trab.professor_id}")

    respond_to do |format|
      if @acum_trab.save
---
INSERT INTO `acum_trabs` (`tot_acum_ant_efet`, `tot_geral_trab`, `pont_base_unid`, `status`, `tot_geral_unid`, `pont_base_trab`, `valor_rede`, `tot_acum_efet`, `valor_efet`, `created_at`, `tot_acum_ant_unid`, `valor_unid`, `updated_at`, `tot_acum_ant_trab`, `tot_acum_rede`, `pont_base_efet`, `tot_acum_unid`, `tot_geral_efet`, `verifica`, `professor_id`, `tot_acum_ant_rede`, `pont_base_rede`, `valor_trab`, `tot_acum_trab`, `tot_geral_rede`) VALUES(0, 0.0, 0.002, 0, 0.0, 0.008, 0.0, 0, 0.0, '2012-07-03 13:17:21', 0, 0.0, '2012-07-03 13:17:21', 0, 0, 0.002, 0, 0.0, 0, 1185, 0, 0.001, 0.0, 0, 0.0)
INSERT INTO `logs` (`data`, `unidade_id`, `obs`, `created_at`, `updated_at`, `acumtrab_id`, `regiao_id`, `titulacao_id`, `professor_id`, `trabalhado_id`, `user_id`, `remocao_id`) VALUES('03/07/12 13:17', NULL, 'Criado valores acumulados para o professor:1185', '2012-07-03 13:17:21', '2012-07-03 13:17:21', NULL, NULL, NULL, 1185, NULL, 1, NULL)

  def update
    @acum_trab = AcumTrab.find(params[:id])
    @log = Log.new
    @log.log(current_user.id, @acum_trab.professor_id, "Realizado calculo dos novos valores para o professor:#{@acum_trab.professor_id}")
     @acum_trab.verifica =0
     $update = 1
    respond_to do |format|
      if @acum_trab.update_attributes(params[:acum_trab])
---
SELECT * FROM `acum_trabs` WHERE (`acum_trabs`.`id` = 1206)
UPDATE `acum_trabs` SET `valor_rede` = 5.069, `tot_acum_rede` = 5069, `updated_at` = '2012-07-05 14:48:46', `valor_efet` = 10.134, `tot_geral_trab` = 5015.0, `status` = 1, `verifica` = 0, `tot_geral_efet` = 5067.0, `tot_acum_trab` = 5015, `tot_geral_rede` = 5069.0, `valor_trab` = 40.12, `tot_acum_efet` = 5067 WHERE `id` = 1206
UPDATE `professors` SET `updated_at` = '2012-07-05 14:48:46', `total_trabalhado` = 55.323, `pontuacao_final` = 60.647 WHERE `id` = 876