app/controllers/fichas_controller.rb

  def index

    @fichas = @professor.fichas.find(:all)
---
SELECT `fichas`.* FROM `fichas` WHERE (`fichas`.professor_id = 876)

  def show
    @ficha = @professor.fichas.find(params[:id])
---
SELECT * FROM `fichas` WHERE (`fichas`.`id` = 3162 AND (`fichas`.professor_id = 876))

  def load_professors
    @professor = Professor.find(params[:professor_id], :include => :fichas)
---
SELECT * FROM `professors` WHERE (`professors`.`id` = 876)