app/controllers/professors_controller.rb

SELECT * FROM `professors` ORDER BY funcao
SELECT * FROM `unidades` ORDER BY nome
SELECT `professors`.* FROM `professors` INNER JOIN `acum_trabs` ON acum_trabs.professor_id = professors.id WHERE (acum_trabs.status = 1)
SELECT count(*) AS count_all FROM `professors`
SELECT * FROM `regiaos` ORDER BY nome
---
  def index
      if params[:search].blank?
        if current_user.regiao_id == 53 or current_user.regiao_id == 52 then
          @search = Professor.search(params[:search])
          @professors = @search.paginate(:all,:page=>params[:page],:per_page =>15, :include => 'unidade', :order => sort_column + " " + sort_direction)
        else
          @search = Professor.search(params[:search])
          @professors = @search.paginate(:page=>params[:page],:per_page =>15,:conditions => ['sede_id = ? or sede_id = 54',current_user.regiao_id], :order => sort_column + " " + sort_direction, :include => "unidade")

SELECT * FROM `professors` WHERE (`professors`.`matricula` = '8437') LIMIT 1
---
     $professor_mat = ''
     $professor_mat = params[:professor_professor_id]
     if !($professor_mat).nil? or !($professor_mat).empty? or !($professor_mat == '')
      if !(Professor.find_by_matricula($professor_mat)).nil? then

SELECT * FROM `acum_trabs` WHERE (professor_id = 876)
---
#|| Inicio Calculos de Tempo de Serviço  ||
# =======================================

    @acum = AcumTrab.find(:all, :conditions => ['professor_id = ' + $professor])

SELECT * FROM `trabalhados` WHERE (ano = 2011 and professor_id= 876 and flag = 0 and ano_letivo = 2012)
---
       $acum_dias_rede_ano = tot_dias.tot_acum_rede.to_i
       $acum_dias_unid_ano = tot_dias.tot_acum_unid.to_i
    end
     @dias_trab_anterior = Trabalhado.find(:all, :conditions => ['ano = ' + $data2.to_s + ' and professor_id= ' + $professor + ' and flag = 0 and ano_letivo = ' + $data.to_s])

SELECT * FROM `professors` WHERE (`professors`.`id` = '876') LIMIT 1
---



    @professors = Professor.find(:all, :conditions => ['id=' + $professor ])

SELECT * FROM `professors` WHERE (`professors`.`matricula` = '8437') LIMIT 1
SELECT * FROM `fichas` WHERE (ano_letivo = '2012') AND (`fichas`.`professor_id` = 876) LIMIT 1
SELECT * FROM `professors` WHERE (id = 876)
SELECT * FROM `trabalhados` WHERE (ano_letivo = '2012' and ano = '2011') AND (`trabalhados`.`professor_id` = 876) LIMIT 1
SELECT * FROM `acum_trabs` WHERE (status = 1) AND (`acum_trabs`.`professor_id` = 876)
SELECT * FROM `professors` ORDER BY funcao
---
  def gerar_ficha
    @ficha = Professor.find_by_matricula(params[:ficha])
    unless @ficha.nil?
      @existe = Trabalhado.find_all_by_professor_id(@ficha.id, :conditions => ['ano_letivo = ?',$data])
      @possui_ficha = Ficha.find_by_professor_id(@ficha.id,:conditions =>['ano_letivo = ?',$data])
      @contagem_finalizada = AcumTrab.find_all_by_professor_id(@ficha.id, :conditions => ['status = 1'])
      if @contagem_finalizada.present?

SELECT * FROM `professors` WHERE (`professors`.`id` = 876) LIMIT 1
---
            @fichas.tot_geral_unid = acum_trab.tot_geral_unid
            @fichas.tot_geral_rede = acum_trab.tot_geral_rede
            @fichas.total_geral = @ficha.pontuacao_final
            @fichas.total_titulacao = Professor.find(@ficha.id).total_titulacao

SELECT * FROM `trabalhados`
---
       acum_dias_unid_ano = tot_dias.tot_acum_unid.to_i
    end
     @dias_trab_anterior = Trabalhado.find(:all, :conditions => ['ano = ? and professor_id = ? and flag = 0 and ano_letivo = ?',$data2.to_s,@ficha.id,$data.to_s])
     if @dias_trab_anterior.empty?

SELECT `professors`.* FROM `professors` INNER JOIN `acum_trabs` ON acum_trabs.professor_id = professors.id WHERE (acum_trabs.status = 1)
---
  def load_esmiucar
    @check_professor = Professor.all(:joins => [:acum_trab], :conditions => ["acum_trabs.status = 1"])

SELECT * FROM `titulacaos` WHERE (`titulacaos`.`id` = 1)
---
  def load_prof_titulos
    @prof_titulos = Titulacao.find(:all, :order => 'descricao')

SELECT * FROM `regiaos` WHERE (`regiaos`.`id` IN (7,8,5,3,6,1,4,2,13,22,23))
---
  def load_regiaos
    @regiaos = Regiao.find(:all, :order => "nome")

SELECT * FROM `unidades` WHERE (`unidades`.`id` IN (5,6,2,4,17,20,21,26,42,43,58,50,60,61))
---
  def load_unidades
    @unidades = Unidade.find(:all, :order => "nome", :include => "regiao")

SELECT pontuacao_titulo FROM `titulo_professors` WHERE (professor_id = 876 and tipo_curso = 0 and ano_letivo = '2012' and validade = 0 and titulo_id in (6,7,8))
---
  def load_titulo_professor
    @titulo_professor = TituloProfessor.find(:all)