app/controllers/titulo_professors_controller.rb

SELECT * FROM `professors` ORDER BY matricula ASC
SELECT * FROM `titulo_professors` WHERE (professor_id = '876' and titulo_id in (6,7,8) and ano_letivo = '2012') LIMIT 0, 20
---
  def index
    if params[:professor].present?
      if params[:type].to_i == 1
        @titulo_busca = TituloProfessor.paginate(:all,:page=>params[:page],:per_page =>20,:conditions =>['professor_id = ? and titulo_id in (6,7,8) and ano_letivo = ?',params[:professor],Time.current.strftime("%Y")])

INSERT INTO `logs` (`user_id`, `regiao_id`, `professor_id`, `remocao_id`, `titulacao_id`, `unidade_id`, `trabalhado_id`, `obs`, `data`, `created_at`, `updated_at`, `acumtrab_id`) VALUES(1, NULL, 876, NULL, NULL, NULL, NULL, 'Cadastrado Titulo do professor.', '05/07/12 13:37', '2012-07-05 13:37:47', '2012-07-05 13:37:47', NULL)
INSERT INTO `titulo_professors` (`dt_titulo`, `validade`, `ano_letivo`, `professor_id`, `status`, `obs`, `dt_validade`, `updated_at`, `created_at`, `valor`, `titulo_id`, `quantidade`, `pontuacao_titulo`, `tipo_curso`) VALUES('2012-05-17', 0, 2012, 876, 1, 'DISTANCIA', '2012-06-30', '2012-07-05 13:54:19', '2012-07-05 13:54:19', 0.024, 8, 10, 0.18, 0)
---
  def create
    @titulo_professor = TituloProfessor.new(params[:titulo_professor])
    @titulo_professor.user = current_user.id
    @titulo_professor.current = Time.current
    @titulo_professor.begin_period = "#{session[:begin_period]}"
    @titulo_professor.end_period =  "#{session[:end_period]}"
    @log = Log.new
    @log.log(current_user.id, @titulo_professor.professor_id, "Cadastrado Titulo do professor.")

    respond_to do |format|
      if @titulo_professor.save

SELECT * FROM `professors` WHERE (`professors`.`id` = 876)
SELECT * FROM `titulo_professors` WHERE (`titulo_professors`.`id` = 14748)
INSERT INTO `logs` (`user_id`, `regiao_id`, `professor_id`, `remocao_id`, `titulacao_id`, `unidade_id`, `trabalhado_id`, `obs`, `data`, `created_at`, `updated_at`, `acumtrab_id`) VALUES(1, NULL, 876, NULL, 14761, NULL, NULL, 'Atualizado', NULL, '2012-07-05 13:39:49', '2012-07-05 13:39:49', NULL)
DELETE FROM `titulo_professors` WHERE `id` = 14748
---
  def destroy
    $r =TituloProfessor.find(params[:id])
    @titulo_professor = TituloProfessor.find(params[:id])
    @at_log = Log.new
    @at_log.titulacao_id = @titulo_professor.id
    @at_log.obs = "Atualizado"
    @at_log.professor_id = @titulo_professor.professor_id
    @at_log.user_id = current_user.id
    @at_log.save
    @titulo_professor.destroy

SELECT * FROM `professors` WHERE (`professors`.`id` = 876)
---
  def sel_prof
    $teacher = params[:titulo_professor_professor_id]
    session[:teacher] = params[:titulo_professor_professor_id]

    if !($teacher.nil? or $teacher.empty?) or $teacher == '' then
      if (Professor.find($teacher)).nil? then

SELECT * FROM `titulacaos` WHERE (`titulacaos`.`id` = '8') LIMIT 1
---
  def guarda_valor

    $id_titulo = params[:titulo_professor_titulo_id]
    $valor = Titulacao.find_by_id($id_titulo).valor

SELECT * FROM `titulacaos` WHERE (`titulacaos`.`id` = 8) LIMIT 1
---
  def load_titulacao
    @titulacaos = Titulacao.find(:all)

SELECT `professors`.id FROM `professors` WHERE (`professors`.`matricula` = 8437 AND `professors`.id <> 876) LIMIT 1
---
  def load_professors
    @professors = Professor.find(:all, :order => "matricula ASC")