app/controllers/trabalhados_controller.rb

  def index
    @busca_trab  = Trabalhado.find_all_by_professor_id((params[:professor].match(/\d+/).to_s).to_i, :conditions => ["flag = 0 and ano_letivo = ?", $data.to_s]) if params[:professor].present?
---
SELECT * FROM `trabalhados` WHERE (flag = 0 and ano_letivo = '2012') AND (`trabalhados`.`professor_id` = 876)

  def edit
    $id = params[:id]
    @trabalhado = Trabalhado.find(params[:id])
---
SELECT * FROM `trabalhados` WHERE (`trabalhados`.`id` = 10530)

  def create
    @trabalhado = Trabalhado.new(params[:trabalhado])
    @trabalhado.ano_letivo = $data
    if $ano != $data then
      @trabalhado.remocao = 0
    end
    if @trabalhado.remocao == true then
      @trabalhado.unidade = 0
    end
    @log = Log.new
    @log.log(current_user.id, @trabalhado.professor_id, "Criado tempo de serviço.Ano:#{@trabalhado.ano} - Ano letivo: #{@trabalhado.ano_letivo}")
    @log.save!
---
INSERT INTO `logs` (`regiao_id`, `trabalhado_id`, `professor_id`, `unidade_id`, `titulacao_id`, `remocao_id`, `obs`, `updated_at`, `data`, `acumtrab_id`, `created_at`, `user_id`) VALUES(NULL, NULL, 876, NULL, NULL, NULL, 'Criado tempo de serviço.Ano:2011 - Ano letivo: 2012', '2012-07-05 14:48:21', '05/07/12 14:48', NULL, '2012-07-05 14:48:21', 1)
INSERT INTO `trabalhados` (`atestado`, `f_injustif`, `dias_rede`, `outras_ausencias`, `ano`, `lic_saude`, `afastamento`, `dias_trab`, `outro_trab`, `f_justif`, `ano_letivo`, `call_back`, `created_at`, `dias_efetivos`, `updated_at`, `flag`, `unidade`, `f_abonada`, `dias_unidade`, `remocao`, `professor_id`, `dias`) VALUES(0, 0, 222, 0, 2012, 0, 0, 222, 0, 0, 2012, NULL, '2012-07-04 09:00:25', 222, '2012-07-04 09:00:25', 0, 0, 0, 0, NULL, 876, 222)


    $teacher = params[:trabalhado_professor_id].to_i
    session[:professor] = params[:trabalhado_professor_id].to_i
    @two_times = Trabalhado.find_all_by_professor_id(session[:professor], :conditions => ["flag = 0 and ano_letivo = ?", $data.to_s])
---
SELECT * FROM `professors` WHERE (id = 1185)
SELECT * FROM `trabalhados` WHERE (flag = 0 and ano_letivo = '2012') AND (`trabalhados`.`professor_id` = 1185)

#      @ano = []
#    end
    if !($teacher.nil?) or !($teacher == '') then
      if (Professor.find($teacher)).nil? then
---
SELECT * FROM `professors` WHERE (`professors`.`id` = 1185) LIMIT 1

      else
        $teacher_id = $teacher
        $professor_id =  $teacher_id
        @acum = AcumTrab.find(:all, :conditions => ['professor_id = ' + ($teacher_id).to_s])
---
SELECT * FROM `acum_trabs` WHERE (professor_id = 1185)

        $voltar = 1
        @inicial = AcumTrab.find(:all, :conditions => ['professor_id = ' + $teacher_id.to_s])
        @professores = Professor.find(:all,:conditions => ['id = ' + $teacher_id.to_s])
        if !@professores.empty? or !@professores.nil? then
---
SELECT * FROM `professors` ORDER BY matricula

  def load_professors
    @professors = Professor.find(:all, :order => 'matricula')
---
SELECT * FROM `professors` WHERE (`professors`.`id` = 876)