app/controllers/unidades_controller.rb

SELECT * FROM `regiaos` WHERE (`regiaos`.`id` = 2)
---
  def load_regiaos
    @regiaos = Regiao.find(:all, :order => "nome")

SELECT * FROM `unidades` ORDER BY nome ASC LIMIT 0, 20
SELECT count(*) AS count_all FROM `unidades`
---
 def index
   if (params[:search].nil? || params[:search].empty?)
      @unidades = Unidade.paginate(:all,:page=>params[:page],:per_page =>20, :order =>  'nome ASC')